# RebarHookOverEndTreatment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarHookOverEndTreatment Property
BuiltInFailures..::..RebarFailures Class See Also
---
Cannot set hook at an end that has end treatment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarHookOverEndTreatment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarHookOverEndTreatment As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarHookOverEndTreatment {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace